In [5]:
# Imports
import os
import pandas as pd
import numpy as np
from scipy import stats
import json

In [6]:
def get_regional_csvs(region: str):
    """
    Returns a list of dataframes of by region
    
    Parameters(s):
        region (str): The region of csvs to load as listed on the riot api website.
    """
    dfs = {}
    type_dict = {'Champion1': 'int16', 'Champion2': 'int16',
             'Champion3': 'int16', 'Champion4': 'int16',
             'Champion5': 'int16'}
    for f in os.listdir('data'):
        if region in f:
            dfs[f.split('_')[1].split('.')[0]] = pd.read_csv(f'data/{f}', dtype=type_dict)
    return dfs

In [7]:
def get_top3_dfs(region: str):
    """
    Returns at list of dataframes by region of the top 3 champions per lane per player.
    
    Parameters(s):
        region (str): The region of csvs to load as listed on the riot api website.
    """
    dfs = {}
    for f in os.listdir('data/top3'):
        if region in f:
            dfs[f.split('_')[1].split('.')[0]] = pd.read_csv(f'data/top3/{f}')
    return dfs

### Load in the Champions by id to dictionary for mapping

In [8]:
raw_champions = None
with open('data/champions.json', encoding="cp866") as f:
    raw_champions = json.load(f)
    
champion_ids_name = {}
for champ in raw_champions['data'].keys():
    champion_ids_name[int(raw_champions['data'][champ]['key'])] = champ

### Combine the regional datasets into one mega dataset

In [9]:
na_top3 = get_top3_dfs('na')
na_top3['diamond'].head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
0,51,272295,bot,145,88254,bot,103,74100,mid,84,...,jg,99,9746,sup,254,7431,jg,114,1286,top
1,55,67222,mid,238,51605,mid,3,51363,mid,39,...,sup,16,10862,sup,202,9299,bot,21,8998,bot
2,39,956886,top,90,109817,mid,98,74811,top,245,...,mid,350,16135,sup,1,14686,mid,18,13146,bot
3,64,154967,jg,517,97859,mid,238,66095,mid,104,...,bot,145,17146,bot,497,6812,sup,555,6105,sup
4,131,514349,jg,103,214265,mid,99,163929,sup,25,...,mid,38,10785,mid,11,9387,jg,113,6642,jg

In [10]:
euw_top3 = get_top3_dfs('euw')
euw_top3['diamond'].head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
0,30,1115282,jg,9,93596,jg,72,65422,jg,119,...,bot,99,12783,sup,555,11723,sup,267,7108,sup
1,202,185698,bot,110,146405,bot,51,142765,bot,157,...,sup,517,46720,mid,412,45436,sup,40,38184,sup
2,432,91600,sup,64,35730,jg,412,35321,sup,111,...,bot,76,16636,jg,517,14381,mid,67,14038,bot
3,84,743488,top,246,83962,mid,92,49463,top,64,...,bot,497,6136,sup,44,4312,sup,43,4260,sup
4,145,112281,bot,15,92945,bot,29,54843,bot,101,...,top,157,9270,mid,35,9021,jg,38,5469,mid

In [11]:
kr_top3 = get_top3_dfs('kr')
kr_top3['diamond'].head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
0,64,66850,jg,104,45310,jg,76,35127,jg,4,...,bot,101,6751,sup,89,4349,sup,350,3814,sup
1,412,79442,sup,236,73300,bot,3,72863,mid,51,...,jg,59,17225,jg,266,14354,top,54,12243,top
2,523,231271,bot,81,135222,bot,145,129195,bot,57,...,top,157,11361,mid,107,7378,top,1,6774,mid
3,92,363189,top,238,223867,mid,39,193324,top,268,...,jg,117,11290,sup,26,10342,sup,67,8515,bot
4,421,1697105,jg,412,706123,sup,64,218576,jg,157,...,sup,81,36247,bot,236,32172,bot,67,25542,bot

In [17]:
na_top3_combined = pd.concat(na_top3.values(), axis=0)
na_top3_length = na_top3_combined.shape[0]

In [18]:
euw_top3_combined = pd.concat(euw_top3.values(), axis=0)
euw_top3_length = euw_top3_combined.shape[0]

In [19]:
kr_top3_combined = pd.concat(kr_top3.values(), axis=0)
kr_top3_length = kr_top3_combined.shape[0]

In [21]:
all_combined = pd.concat([na_top3_combined, euw_top3_combined, kr_top3_combined], axis=0)
print(f'Number of rows in combined: {all_combined.shape[0]}')
print(f'Number of rows of regions summed: {na_top3_length + euw_top3_length + kr_top3_length}')

Number of rows in combined: 23572
Number of rows of regions summed: 23572

In [22]:
all_combined.head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
0,11,228838,jg,141,127298,jg,107,75772,top,555,...,sup,12,26501,sup,84,21316,top,51,12740,bot
1,99,158190,sup,16,108973,sup,267,101700,sup,21,...,jg,163,17509,jg,39,16153,top,10,11956,top
2,84,134256,top,145,124395,bot,157,87764,mid,99,...,sup,245,27580,jg,254,25642,jg,875,24216,top
3,267,107035,sup,350,99720,sup,16,46863,sup,68,...,mid,81,9618,bot,202,8821,bot,523,5726,bot
4,21,131246,bot,75,74165,top,54,67741,top,17,...,mid,32,10750,sup,90,9949,mid,45,8198,mid

### Replace champion Ids with Champion names

In [23]:
all_combined = all_combined.replace(champion_ids_name)
all_combined.head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
0,MasterYi,228838,jg,Kayn,127298,jg,Rengar,75772,top,Pyke,...,sup,Alistar,26501,sup,Akali,21316,top,Caitlyn,12740,bot
1,Lux,158190,sup,Soraka,108973,sup,Nami,101700,sup,MissFortune,...,jg,Taliyah,17509,jg,Irelia,16153,top,Kayle,11956,top
2,Akali,134256,top,Kaisa,124395,bot,Yasuo,87764,mid,Lux,...,sup,Ekko,27580,jg,Vi,25642,jg,Sett,24216,top
3,Nami,107035,sup,Yuumi,99720,sup,Soraka,46863,sup,Rumble,...,mid,Ezreal,9618,bot,Jhin,8821,bot,Aphelios,5726,bot
4,MissFortune,131246,bot,Nasus,74165,top,Malphite,67741,top,Teemo,...,mid,Amumu,10750,sup,Malzahar,9949,mid,Veigar,8198,mid

### Set dtypes to correct type

In [24]:
all_combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23572 entries, 0 to 1525
Data columns (total 45 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Champion1   23572 non-null  object
 1   Mastery1    23572 non-null  int64
 2   Lane1       23572 non-null  object
 3   Champion2   23572 non-null  object
 4   Mastery2    23572 non-null  int64
 5   Lane2       23572 non-null  object
 6   Champion3   23572 non-null  object
 7   Mastery3    23572 non-null  int64
 8   Lane3       23572 non-null  object
 9   Champion4   23572 non-null  object
 10  Mastery4    23572 non-null  int64
 11  Lane4       23572 non-null  object
 12  Champion5   23572 non-null  object
 13  Mastery5    23572 non-null  int64
 14  Lane5       23572 non-null  object
 15  Champion6   23572 non-null  object
 16  Mastery6    23572 non-null  int64
 17  Lane6       23572 non-null  object
 18  Champion7   23572 non-null  object
 19  Mastery7    23572 non-null  int64
 20  Lane7       23572 non-null  object
 21  Champion8   23572 non-null  object
 22  Mastery8    23572 non-null  int64
 23  Lane8       23572 non-null  object
 24  Champion9   23572 non-null  object
 25  Mastery9    23572 non-null  int64
 26  Lane9       23572 non-null  object
 27  Champion10  23572 non-null  object
 28  Mastery10   23572 non-null  int64
 29  Lane10      23572 non-null  object
 30  Champion11  23572 non-null  object
 31  Mastery11   23572 non-null  int64
 32  Lane11      23572 non-null  object
 33  Champion12  23572 non-null  object
 34  Mastery12   23572 non-null  int64
 35  Lane12      23572 non-null  object
 36  Champion13  23572 non-null  object
 37  Mastery13   23572 non-null  object
 38  Lane13      23572 non-null  object
 39  Champion14  23572 non-null  object
 40  Mastery14   23572 non-null  object
 41  Lane14      23572 non-null  object
 42  Champion15  23572 non-null  object
 43  Mastery15   23572 non-null  object
 44  Lane15      23572 non-null  object
dtypes: int64(12), object(33)
memory usage: 8.3+ MB

In [26]:
def is_valid_mastery(x):
    if isinstance(x, str):
        if x.isnumeric():
            return True
        else:
            return False
    return True

In [27]:
# Mastery 13, 14, and 15 are the only affected columns
valid_rows = all_combined['Mastery13'].apply(is_valid_mastery) & all_combined['Mastery14'].apply(is_valid_mastery) & all_combined['Mastery15'].apply(is_valid_mastery)

In [29]:
# The cells that contain champion names in mastery rows
all_combined[~valid_rows]

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
178,Fiddlesticks,400267,jg,Karthus,265349,jg,Hecarim,154919,jg,Twitch,...,top,Braum,2669,sup,Malphite,1453,top,Gnar,Sett,top
527,Xerath,300790,sup,Swain,278799,sup,Brand,165905,sup,Darius,...,jg,KogMaw,3672,bot,MissFortune,2963,bot,Jhin,Gnar,bot
173,LeeSin,114257,jg,JarvanIV,110261,jg,Ezreal,98170,bot,Kaisa,...,top,Pantheon,6776,sup,Senna,4418,sup,Leona,Khazix,sup
148,MasterYi,256486,jg,Morgana,213564,sup,Teemo,143814,top,MissFortune,...,top,LeeSin,2954,jg,Yasuo,1540,mid,Annie,Akshan,mid
361,Janna,45283,sup,Yuumi,42723,sup,Trundle,30631,jg,Udyr,...,mid,Sivir,Sett,bot,Zoe,843,mid,Varus,452,bot
373,Volibear,121060,top,Shaco,49656,jg,Warwick,47777,jg,Hecarim,...,mid,Sivir,1623,bot,Varus,994,bot,KogMaw,Gwen,bot
661,Kayn,125402,jg,Olaf,69549,jg,MissFortune,54485,bot,Tristana,...,sup,Lux,3453,sup,Yasuo,2793,mid,Blitzcrank,Quinn,sup
1160,Thresh,59191,sup,Pyke,58415,sup,Trundle,53941,jg,Senna,...,mid,Jinx,722,bot,Ahri,Kaisa,mid,Ryze,129,mid
2006,Nasus,72160,top,Aatrox,69300,top,Jax,68036,top,MasterYi,...,mid,Kalista,4083,bot,Ashe,2449,bot,Jhin,RekSai,bot
2100,Lucian,166329,bot,Caitlyn,76331,bot,Ezreal,67108,bot,Yasuo,...,jg,Jayce,2681,top,Velkoz,663,sup,Swain,Viego,sup
186,Fiddlesticks,246802,jg,Poppy,185886,jg,Trundle,64617,jg,Yorick,...,mid,Galio,3124,mid,Sivir,493,bot,Twitch,Camille,bot
340,Velkoz,870530,sup,Warwick,594292,jg,Amumu,149216,sup,Vi,...,top,Twitch,967,bot,Tristana,941,bot,Ezreal,Gnar,bot
687,Zed,75825,mid,Katarina,74185,mid,MasterYi,58013,jg,Riven,...,bot,Thresh,6195,sup,Amumu,1502,sup,Leona,Sett,sup
1357,Kassadin,108834,mid,Viktor,105351,mid,Leblanc,55017,mid,Irelia,...,jg,Janna,1273,sup,Brand,Gwen,sup,Alistar,384,sup
202,Akali,158095,top,Yone,105069,mid,Ryze,98140,mid,Galio,...,jg,Taliyah,3559,jg,Zilean,1196,sup,Janna,Bard,sup
688,Xayah,659411,bot,Jinx,316673,bot,Tristana,304271,bot,Thresh,...,top,Shyvana,Gnar,jg,Fiddlesticks,123,jg,Olaf,Fizz,jg
17,Darius,245183,top,Blitzcrank,122605,sup,Teemo,114945,top,Nasus,...,bot,Yasuo,Nami,mid,Orianna,151,mid,Annie,Seraphine,mid
1203,Ezreal,70699,bot,Lux,49300,sup,Jinx,47084,bot,Kaisa,...,top,Garen,377,top,MonkeyKing,Kindred,jg,Akali,Jhin,top
109,Sett,432679,top,Nunu,277627,jg,Yone,76758,mid,Lux,...,mid,Kaisa,3285,bot,Twitch,1188,bot,MissFortune,Gnar,bot
247,Darius,158066,top,Yasuo,41512,mid,Renekton,40756,top,Sett,...,bot,Jinx,2746,bot,Nautilus,2157,sup,Lux,Camille,sup
373,Elise,188388,jg,LeeSin,142288,jg,Khazix,104573,jg,Rengar,...,mid,Sylas,1093,mid,Ahri,929,mid,Sivir,TahmKench,bot
487,Yuumi,373057,sup,Caitlyn,122715,bot,Kaisa,111253,bot,Morgana,...,mid,Annie,584,mid,LeeSin,Diana,jg,Yasuo,130,mid
1190,Fizz,92904,mid,Shaco,78956,jg,Akali,78551,top,Graves,...,bot,Kalista,6221,bot,Karma,920,sup,Morgana,Illaoi,sup
1388,Maokai,313898,sup,Camille,231891,top,Renekton,119577,top,Rumble,...,bot,Cassiopeia,851,mid,Jinx,766,bot,Neeko,Taliyah,mid
1416,Thresh,100724,sup,Ezreal,85757,bot,Caitlyn,62841,bot,MissFortune,...,jg,Zed,309,mid,Yone,179,mid,Syndra,Nautilus,mid
1425,Sylas,77135,mid,Ekko,54689,jg,Kassadin,47875,mid,Graves,...,bot,Lucian,1363,bot,Thresh,Pyke,sup,Soraka,359,sup
113,Kaisa,69517,bot,Nidalee,61913,jg,Jhin,58627,bot,LeeSin,...,top,Senna,4166,sup,Camille,4009,top,Blitzcrank,Akshan,sup
155,Aphelios,206416,bot,Jhin,191704,bot,Kaisa,146653,bot,Blitzcrank,...,mid,Gwen,Yone,top,Camille,328,top,Kayle,Yasuo,top
273,Maokai,663108,sup,Nami,463161,sup,Lulu,325807,sup,Shen,...,mid,Ziggs,845,bot,MissFortune,168,bot,Twitch,Yasuo,bot
618,Lulu,43043,sup,Kaisa,39214,bot,Ashe,32862,bot,Ezreal,...,top,Fiddlesticks,652,jg,Nunu,Taliyah,jg,JarvanIV,139,jg
1090,Ashe,298317,bot,Jhin,251820,bot,Kaisa,176399,bot,Senna,...,sup,Olaf,2104,jg,Annie,1312,mid,Ahri,Vi,mid

In [30]:
all_combined.shape

(23572, 45)

In [31]:
all_combined = all_combined[valid_rows]
all_combined.shape

(23541, 45)

In [35]:
# set dtypes
all_combined = all_combined.astype({f'Mastery{i}': np.int64 for i in range(1, 16)})

### Helper function that gets the top 3 champions by lane for someone who mains a champion

In [37]:
def get_top3_by_champion(champ: str, df: pd.DataFrame):
    champ_df = df[df['Champion1'] == champ].copy()
    if champ_df.shape[0] == 0:
        return "Not enough data!"
    
    # Get the inverse mastery proportion
    champ_df[[f'Mastery{i}' for i in range(2, 16)]] = (1-champ_df[[f'Mastery{i}' for i in range(2, 16)]].div(champ_df[[f'Mastery{i}' for i in range(2, 16)]][[f'Mastery{i}' for i in range(2, 16)]].sum(axis=1), axis=0))
    
    # Get the lanes, masteries, and champions as series
    champ_lanes = champ_df[[f'Lane{i}' for i in range(2, 16)]].stack().reset_index(drop=True)
    champ_mastery = champ_df[[f'Mastery{i}' for i in range(2, 16)]].stack().reset_index(drop=True)
    champ_champs = champ_df[[f'Champion{i}' for i in range(2, 16)]].stack().reset_index(drop=True)
    champ_combined = pd.concat([champ_lanes, champ_mastery, champ_champs], axis=1)
    champ_combined.columns = ['Lane', 'Mastery', 'Champion']
    
    # Get the top 3 champions for our champ by lane
    lanes = ['top', 'jg', 'mid', 'bot', 'sup']
    dfs = pd.DataFrame(columns=['Champion', 'Mastery', 'Lane'])
    for lane in lanes:
        counts = champ_combined.groupby(['Lane', 'Champion']).count().loc[lane, :].sort_index()
        means = champ_combined.groupby(['Lane', 'Champion']).mean().loc[lane, :].sort_index()
        lane_champs = means.div(counts, axis=1).sort_values('Mastery', ascending=True).iloc[:3].reset_index()
        lane_champs['Lane'] = [lane] * 3
        dfs = pd.concat([dfs, lane_champs])
    return dfs.reset_index(drop=True)

Proportion_of_Mastery = champion_mastery / total_mastery (for a given player)
<br>
<br>
Total_Number_Played = Number of players that main X champion that also play the given champion
<br>
<br>
Mastery = (1 - Proportion_of_Mastery) / Total_Number_Played
<br>
<br>
Similarity = 1 - Mastery

### Get the top 3 champions per lane per champion

In [38]:
champ_dfs = {}
for champ in champion_ids_name.values():
    response = get_top3_by_champion(champ, all_combined)
    if isinstance(response, str):
        print(champ)
        print("Not enough data for that champ")
    champ_dfs[champ] = response

Renata
Not enough data for that champ

In [39]:
champ_dfs['Ziggs']

       Champion   Mastery Lane
0         Teemo  0.134465  top
1         Garen  0.157856  top
2      Malphite  0.186343  top
3          Nunu  0.115756   jg
4         Shaco  0.149309   jg
5         Diana  0.152086   jg
6          Ahri  0.130632  mid
7        Veigar  0.132669  mid
8         Galio  0.134642  mid
9        Ezreal  0.102959  bot
10  MissFortune  0.115246  bot
11         Ashe  0.130148  bot
12          Lux  0.074812  sup
13      Morgana  0.103384  sup
14        Swain  0.118278  sup

### Load the Champion to Lane Data

In [40]:
def get_champ_lane(champ: str):
    champ_lane_df = all_combined[all_combined['Champion1'] == champ]['Lane1']
    if champ_lane_df.shape[0] == 0:
        return False
    return champ_lane_df.iloc[0]

In [41]:
# Save champion to lane csv
champ_to_lane = {'Champion': [], 'Lane': []}
for champ in champ_dfs:
    lane = get_champ_lane(champ)
    if not lane:
        continue
    champ_to_lane['Lane'].append(lane)
    champ_to_lane['Champion'].append(champ)
champ_to_lane_df = pd.DataFrame.from_dict(champ_to_lane)
champ_to_lane_df.to_csv('data/ChampionsToLane.csv', index=False)

### Stack the dataframes on top of each other, with a column containing the champion origin

In [43]:
def get_final_top3_columns():
    cols = ['lane']
    lanes = ['top', 'jg', 'mid', 'bot', 'sup']
    for lane in lanes:
        for i in range(1, 4):
            cols.append(f'{lane}{i}')
            cols.append(f'{lane}_dist{i}')
    return cols

In [ ]:
# # All one row
# final_top3_data = []
# final_top3_columns = get_final_top3_columns()
# indicies = []
# for champ in champ_dfs:
#     if isinstance(champ_dfs[champ], str):
#         continue
#     indicies.append(champ)
#     col_data = champ_dfs[champ][['Champion', 'Mastery']].values.flatten()
#     col_data = np.insert(col_data, 0, get_champ_lane(champ))
#     final_top3_data.append(col_data)
# final_top3_df = pd.DataFrame(data=final_top3_data, columns=final_top3_columns, index=indicies)
# final_top3_df.head()

In [45]:
# Create 5 diff dataframes each containg connections from main champion to lane
lanes = ['top', 'jg', 'mid', 'bot', 'sup']
dfs = {lane:pd.DataFrame.from_dict({'Main Champion': [], 'Champion':[], 'Mastery':[]}) for lane in lanes}
for champ in champ_dfs:
    if isinstance(champ_dfs[champ], str):
        continue
    for lane in lanes:
        champ_data = champ_dfs[champ].groupby('Lane')[['Champion', 'Mastery']].get_group(lane)
        champ_data['Main Champion'] = [champ] * champ_data.shape[0]
        dfs[lane] = pd.concat([dfs[lane], champ_data])

In [46]:
dfs['top'].shape # 158 * 3 = 474

(474, 3)

In [47]:
dfs['top'].head()

  Main Champion Champion   Mastery
0        Aatrox   Darius  0.027552
1        Aatrox     Sett  0.028557
2        Aatrox  Camille  0.032823
0          Ahri    Akali   0.01105
1          Ahri   Irelia  0.013226

### Save recommendations by lane csv

In [387]:
for lane in lanes:
    dfs[lane].to_csv(f'data/recommendations/{lane}_recommendations.csv')

In [101]:
final_top3_df.isna().sum().sum()

0

In [79]:
final_top3_df.to_csv('data/champion_top3_by_lane.csv')

In [181]:
na_top3_combined = na_top3_combined.replace(champion_ids_name)
na_top3_combined.head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
0,MasterYi,228838,jg,Kayn,127298,jg,Rengar,75772,top,Pyke,...,sup,Alistar,26501,sup,Akali,21316,top,Caitlyn,12740,bot
1,Lux,158190,sup,Soraka,108973,sup,Nami,101700,sup,MissFortune,...,jg,Taliyah,17509,jg,Irelia,16153,top,Kayle,11956,top
2,Akali,134256,top,Kaisa,124395,bot,Yasuo,87764,mid,Lux,...,sup,Ekko,27580,jg,Vi,25642,jg,Sett,24216,top
3,Nami,107035,sup,Yuumi,99720,sup,Soraka,46863,sup,Rumble,...,mid,Ezreal,9618,bot,Jhin,8821,bot,Aphelios,5726,bot
4,MissFortune,131246,bot,Nasus,74165,top,Malphite,67741,top,Teemo,...,mid,Amumu,10750,sup,Malzahar,9949,mid,Veigar,8198,mid

In [196]:
aatrox_df = na_top3_combined[na_top3_combined['Champion1'] == 'Aatrox'].copy()
aatrox_df.head()

,Champion1,Mastery1,Lane1,Champion2,Mastery2,Lane2,Champion3,Mastery3,Lane3,Champion4,...,Lane12,Champion13,Mastery13,Lane13,Champion14,Mastery14,Lane14,Champion15,Mastery15,Lane15
244,Aatrox,526783,top,Ornn,151745,top,Rakan,103861,sup,Swain,...,bot,Ashe,15528,bot,Jinx,14787,bot,Galio,6117,mid
452,Aatrox,79163,top,Urgot,79057,top,Sylas,60301,mid,Darius,...,bot,AurelionSol,33484,mid,Lucian,23713,bot,Pantheon,23593,sup
456,Aatrox,46933,top,Lucian,40977,bot,Twitch,39645,bot,Gnar,...,mid,Cassiopeia,15003,mid,Pantheon,9262,sup,Senna,9018,sup
55,Aatrox,182187,top,Irelia,97038,top,Kaisa,73832,bot,Yasuo,...,jg,Thresh,34307,sup,Pyke,18560,sup,Senna,12755,sup
236,Aatrox,145401,top,Irelia,118386,top,Morgana,95141,sup,Nautilus,...,bot,Vladimir,32074,mid,XinZhao,28331,jg,MonkeyKing,16918,jg

In [184]:
aatrox_df[[f'Mastery{i}' for i in range(2, 16)]].sum(axis=1).head()

244    668819.0
452    641081.0
456    317929.0
55     667168.0
236    857529.0
dtype: float64

In [185]:
aatrox_df[[f'Mastery{i}' for i in range(2, 16)]].head()

,Mastery2,Mastery3,Mastery4,Mastery5,Mastery6,Mastery7,Mastery8,Mastery9,Mastery10,Mastery11,Mastery12,Mastery13,Mastery14,Mastery15
244,151745,103861,67377,59648,58066,56977,44950,26467,25184,21131,16981,15528,14787,6117
452,79057,60301,58471,56293,49645,48863,47187,44728,39958,39335,36453,33484,23713,23593
456,40977,39645,37340,29545,28863,22777,20198,17652,16991,15467,15191,15003,9262,9018
55,97038,73832,70342,57201,52014,48455,45686,43545,40008,38999,34426,34307,18560,12755
236,118386,95141,94132,87629,81971,73384,61286,53690,42305,38039,34243,32074,28331,16918

In [197]:
(1 - aatrox_df[[f'Mastery{i}' for i in range(2, 16)]].div(aatrox_df[[f'Mastery{i}' for i in range(2, 16)]].sum(axis=1), axis=0)).head()

,Mastery2,Mastery3,Mastery4,Mastery5,Mastery6,Mastery7,Mastery8,Mastery9,Mastery10,Mastery11,Mastery12,Mastery13,Mastery14,Mastery15
244,0.773115,0.844710,0.899260,0.910816,0.913181,0.914810,0.932792,0.960427,0.962346,0.968406,0.974610,0.976783,0.977891,0.990854
452,0.876682,0.905939,0.908793,0.912191,0.922560,0.923780,0.926395,0.930230,0.937671,0.938643,0.943138,0.947769,0.963011,0.963198
456,0.871113,0.875302,0.882552,0.907070,0.909216,0.928358,0.936470,0.944478,0.946557,0.951351,0.952219,0.952810,0.970868,0.971635
55,0.854552,0.889335,0.894566,0.914263,0.922038,0.927372,0.931522,0.934732,0.940033,0.941545,0.948400,0.948578,0.972181,0.980882
236,0.861945,0.889052,0.890229,0.897812,0.904410,0.914424,0.928532,0.937390,0.950666,0.955641,0.960068,0.962597,0.966962,0.980271

### OLD DATA Load data by region

In [3]:
na_dfs = get_regional_csvs('na')
kr_dfs = get_regional_csvs('kr')
euw_dfs = get_regional_csvs('euw')

In [4]:
na_dfs['diamond'].head()

,Champion1,Mastery1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,875,392982,240,281442,245,271693,14,239201,13,161435
1,92,178830,24,168553,126,119510,164,101045,114,79445
2,55,397277,34,292924,112,96573,121,81492,432,49467
3,412,416106,74,168156,432,132571,117,87439,111,68316
4,18,98100,518,92424,222,70200,89,68836,145,36349

In [5]:
kr_dfs['diamond'].head()

,Champion1,Mastery1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,266,124094,126,77659,39,64466,164,40700,517,39502
1,238,429884,236,134557,145,130125,67,101330,64,85474
2,234,225320,10,179661,777,176145,120,161611,104,119311
3,412,360116,238,212892,92,212037,107,193670,7,182946
4,157,172559,92,118584,91,111408,64,103294,238,101800

In [6]:
euw_dfs['diamond'].head()

,Champion1,Mastery1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,117,145461,267,103061,43,96639,497,85432,235,81444
1,55,2152096,40,434336,37,163254,117,45074,16,30901
2,29,343736,145,227872,81,163469,222,156098,96,102269
3,76,75694,131,75250,104,67350,5,56997,102,44987
4,236,57761,238,34488,8,28604,103,24610,7,24509

In [7]:
na_combined = pd.concat(na_dfs.values(), axis=0)
na_combined.head()

,Champion1,Mastery1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,50,114359,114,92161,427,79025,32,63376,350,57265
1,21,98748,58,65117,13,55159,236,54129,67,53659
2,99,227286,25,90071,61,85030,103,66518,115,65364
3,58,98576,82,44299,3,41376,6,40942,86,39732
4,84,391931,145,139374,67,98345,28,93254,142,85232

In [8]:
na_combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7944 entries, 0 to 1836
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Champion1  7944 non-null   int16
 1   Mastery1   7944 non-null   int64
 2   Champion2  7944 non-null   int16
 3   Mastery2   7944 non-null   int64
 4   Champion3  7944 non-null   int16
 5   Mastery3   7944 non-null   int64
 6   Champion4  7944 non-null   int16
 7   Mastery4   7944 non-null   int64
 8   Champion5  7944 non-null   int16
 9   Mastery5   7944 non-null   int64
dtypes: int16(5), int64(5)
memory usage: 450.0 KB

In [17]:
na_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']] = na_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']].div(na_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']].sum(axis=1), axis=0)

In [19]:
# Don't need the first champion's mastery
na_combined = na_combined.drop(['Mastery1'], axis=1)
na_combined.head()

,Champion1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,50,114,0.315807,427,0.270794,32,0.217170,350,0.196229
1,21,58,0.285521,13,0.241858,236,0.237341,67,0.235280
2,99,25,0.293407,61,0.276986,103,0.216683,115,0.212924
3,58,82,0.266302,3,0.248730,6,0.246121,86,0.238847
4,84,145,0.334869,67,0.236290,28,0.224058,142,0.204784

In [24]:
import json

In [10]:
raw_champions = None
with open('data/champions.json', encoding="cp866") as f:
    raw_champions = json.load(f)

In [11]:
raw_champions = None
with open('data/champions.json', encoding="cp866") as f:
    raw_champions = json.load(f)
    
champion_ids_name = {}
for champ in raw_champions['data'].keys():
    champion_ids_name[int(raw_champions['data'][champ]['key'])] = champ

In [34]:
champion_ids_name

{266: 'Aatrox',
 103: 'Ahri',
 84: 'Akali',
 166: 'Akshan',
 12: 'Alistar',
 32: 'Amumu',
 34: 'Anivia',
 1: 'Annie',
 523: 'Aphelios',
 22: 'Ashe',
 136: 'AurelionSol',
 268: 'Azir',
 432: 'Bard',
 53: 'Blitzcrank',
 63: 'Brand',
 201: 'Braum',
 51: 'Caitlyn',
 164: 'Camille',
 69: 'Cassiopeia',
 31: 'Chogath',
 42: 'Corki',
 122: 'Darius',
 131: 'Diana',
 119: 'Draven',
 36: 'DrMundo',
 245: 'Ekko',
 60: 'Elise',
 28: 'Evelynn',
 81: 'Ezreal',
 9: 'Fiddlesticks',
 114: 'Fiora',
 105: 'Fizz',
 3: 'Galio',
 41: 'Gangplank',
 86: 'Garen',
 150: 'Gnar',
 79: 'Gragas',
 104: 'Graves',
 887: 'Gwen',
 120: 'Hecarim',
 74: 'Heimerdinger',
 420: 'Illaoi',
 39: 'Irelia',
 427: 'Ivern',
 40: 'Janna',
 59: 'JarvanIV',
 24: 'Jax',
 126: 'Jayce',
 202: 'Jhin',
 222: 'Jinx',
 145: 'Kaisa',
 429: 'Kalista',
 43: 'Karma',
 30: 'Karthus',
 38: 'Kassadin',
 55: 'Katarina',
 10: 'Kayle',
 141: 'Kayn',
 85: 'Kennen',
 121: 'Khazix',
 203: 'Kindred',
 240: 'Kled',
 96: 'KogMaw',
 7: 'Leblanc',
 64: 'LeeSin',
 89: 'Leona',
 876: 'Lillia',
 127: 'Lissandra',
 236: 'Lucian',
 117: 'Lulu',
 99: 'Lux',
 54: 'Malphite',
 90: 'Malzahar',
 57: 'Maokai',
 11: 'MasterYi',
 21: 'MissFortune',
 62: 'MonkeyKing',
 82: 'Mordekaiser',
 25: 'Morgana',
 267: 'Nami',
 75: 'Nasus',
 111: 'Nautilus',
 518: 'Neeko',
 76: 'Nidalee',
 56: 'Nocturne',
 20: 'Nunu',
 2: 'Olaf',
 61: 'Orianna',
 516: 'Ornn',
 80: 'Pantheon',
 78: 'Poppy',
 555: 'Pyke',
 246: 'Qiyana',
 133: 'Quinn',
 497: 'Rakan',
 33: 'Rammus',
 421: 'RekSai',
 526: 'Rell',
 888: 'Renata',
 58: 'Renekton',
 107: 'Rengar',
 92: 'Riven',
 68: 'Rumble',
 13: 'Ryze',
 360: 'Samira',
 113: 'Sejuani',
 235: 'Senna',
 147: 'Seraphine',
 875: 'Sett',
 35: 'Shaco',
 98: 'Shen',
 102: 'Shyvana',
 27: 'Singed',
 14: 'Sion',
 15: 'Sivir',
 72: 'Skarner',
 37: 'Sona',
 16: 'Soraka',
 50: 'Swain',
 517: 'Sylas',
 134: 'Syndra',
 223: 'TahmKench',
 163: 'Taliyah',
 91: 'Talon',
 44: 'Taric',
 17: 'Teemo',
 412: 'Thresh',
 18: 'Tristana',
 48: 'Trundle',
 23: 'Tryndamere',
 4: 'TwistedFate',
 29: 'Twitch',
 77: 'Udyr',
 6: 'Urgot',
 110: 'Varus',
 67: 'Vayne',
 45: 'Veigar',
 161: 'Velkoz',
 711: 'Vex',
 254: 'Vi',
 234: 'Viego',
 112: 'Viktor',
 8: 'Vladimir',
 106: 'Volibear',
 19: 'Warwick',
 498: 'Xayah',
 101: 'Xerath',
 5: 'XinZhao',
 157: 'Yasuo',
 777: 'Yone',
 83: 'Yorick',
 350: 'Yuumi',
 154: 'Zac',
 238: 'Zed',
 221: 'Zeri',
 115: 'Ziggs',
 26: 'Zilean',
 142: 'Zoe',
 143: 'Zyra'}

In [35]:
na_combined[[f'Champion{i}' for i in range(1, 6)]] = na_combined[[f'Champion{i}' for i in range(1, 6)]].replace(champion_ids_name)
na_combined.head()

,Champion1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,Swain,Fiora,0.315807,Ivern,0.270794,Amumu,0.217170,Yuumi,0.196229
1,MissFortune,Renekton,0.285521,Ryze,0.241858,Lucian,0.237341,Vayne,0.235280
2,Lux,Morgana,0.293407,Orianna,0.276986,Ahri,0.216683,Ziggs,0.212924
3,Renekton,Mordekaiser,0.266302,Galio,0.248730,Urgot,0.246121,Garen,0.238847
4,Akali,Kaisa,0.334869,Vayne,0.236290,Evelynn,0.224058,Zoe,0.204784

In [54]:
pd.value_counts(na_combined[na_combined.isin(['Ziggs']).any(axis=1)][[f'Champion{i}' for i in range(1, 6)]].values.flatten())

Ziggs           47
Lux              8
Xerath           6
Morgana          6
Diana            5
                ..
Maokai           1
Rakan            1
Fiddlesticks     1
Zoe              1
Sivir            1
Length: 97, dtype: int64

In [40]:
na_combined.groupby('Champion1')[[f'Champion{i}' for i in range(2, 6)]].agg(pd.Series.mode)

,Champion2,Champion3,Champion4,Champion5
Champion1,,,,
Aatrox,"[Darius, Mordekaiser]",Darius,Sett,Camille
Ahri,Lux,Lux,Neeko,Lux
Akali,Yasuo,Yasuo,Ahri,Ezreal
Akshan,"[Katarina, Khazix, Sett, Yorick]","[Kayn, Seraphine, Swain, Viego]","[Graves, Illaoi, Thresh, Zac]","[Camille, Ekko, Morgana, Sylas]"
Alistar,Nautilus,Blitzcrank,Blitzcrank,Rakan
...,...,...,...,...
Zeri,"[Ezreal, Lux]","[Kaisa, MissFortune]","[Teemo, Tristana]","[Caitlyn, Morgana]"
Ziggs,"[Diana, Galio, Neeko, Rumble, Vi]",Akali,"[Corki, Katarina, Malphite, Neeko, Sylas]","[Ahri, Fizz, Lux, Morgana, Xerath]"
Zilean,Thresh,"[Janna, Morgana, Thresh]",Morgana,Janna
Zoe,Lux,Neeko,Akali,"[Ezreal, Qiyana]"
Zyra,Lux,Soraka,Soraka,"[Brand, Lux, Senna]"

In [37]:
pd.value_counts(na_combined[na_combined.isin(['Swain']).any(axis=1)][[f'Champion{i}' for i in range(2, 6)]].values.flatten())

Swain          169
Lux             23
Jhin            19
Xerath          18
Mordekaiser     18
              ...
Hecarim          1
Xayah            1
Shyvana          1
Elise            1
Quinn            1
Length: 142, dtype: int64

In [81]:
na_combined.value_counts()

Champion1  Champion2  Champion3  Champion4  Champion5
99         267        16         37         40           2
103        84         99         142        147          2
1          3          74         497        267          1
145        84         157        81         39           1
           81         523        236        202          1
                                                        ..
75         157        83         62         38           1
           145        81         235        134          1
           141        45         91         86           1
                      8          121        238          1
888        412        43         432        16           1
Length: 6894, dtype: int64

In [90]:
na_combined.groupby('Champion1').size()

Champion1
1      22
2      11
3      30
4      25
5      17
       ..
777    33
875    88
876     9
887     4
888     1
Length: 159, dtype: int64

In [95]:
champion_ids = sorted(na_combined['Champion1'].unique())
champion_ids[:5]

[1, 2, 3, 4, 5]

In [116]:
na_combined[na_combined.isin([1]).any(axis=1)].head()

     Champion1  Champion2  Champion3  Champion4  Champion5
119          1         99        246         25        518
183        133        101         53          1          6
202         22         63          1         21        145
221         90          3         74          1         86
233          7         18        222         69          1

In [125]:
pd.value_counts(na_combined[na_combined.isin([1]).any(axis=1)].values.flatten())

1      101
99      14
202     13
45      11
245     10
      ...
15       1
76       1
41       1
56       1
34       1
Length: 124, dtype: int64

In [ ]:
def most_common_ids(id):
    # get all rows with the given id
    return

In [98]:
na_combined.groupby('Champion1')

In [89]:
na_combined.groupby('Champion1')['Champion2'].value_counts().to_frame()

                     Champion2
Champion1 Champion2
1         45                 2
          99                 2
          134                2
          3                  1
          8                  1
...                        ...
876       266                1
887       875                2
          38                 1
          518                1
888       412                1

[3948 rows x 1 columns]

In [77]:
na_combined[na_combined['Champion1'] == 1]['Champion2'].value_counts()

99     2
134    2
45     2
18     1
31     1
11     1
77     1
143    1
53     1
58     1
8      1
202    1
117    1
30     1
131    1
157    1
63     1
875    1
3      1
Name: Champion2, dtype: int64

In [78]:
na_combined[na_combined['Champion1'] == 1]['Champion3'].value_counts()

103    2
61     2
22     2
246    1
12     1
32     1
17     1
16     1
98     1
102    1
203    1
64     1
112    1
222    1
90     1
29     1
5      1
245    1
74     1
Name: Champion3, dtype: int64

In [79]:
na_combined[na_combined['Champion1'] == 1]['Champion4'].value_counts()

25     1
29     1
497    1
420    1
103    1
245    1
30     1
58     1
203    1
127    1
201    1
82     1
421    1
98     1
81     1
18     1
63     1
11     1
31     1
120    1
202    1
59     1
Name: Champion4, dtype: int64

In [80]:
na_combined[na_combined['Champion1'] == 1]['Champion5'].value_counts()

45     3
267    2
518    1
13     1
74     1
75     1
28     1
18     1
497    1
117    1
91     1
145    1
22     1
56     1
238    1
50     1
77     1
141    1
134    1
Name: Champion5, dtype: int64

In [68]:
na_combined.pivot_table(index='Champion1', aggfunc=stats.mode)

              Champion2     Champion3     Champion4     Champion5
Champion1
1           ([45], [2])   ([22], [2])   ([11], [1])   ([45], [3])
2            ([3], [1])  ([141], [2])   ([11], [1])    ([5], [1])
3           ([99], [2])  ([111], [3])  ([104], [2])   ([68], [2])
4           ([35], [2])  ([112], [4])    ([5], [2])   ([22], [2])
5           ([64], [3])    ([9], [2])  ([777], [2])   ([11], [2])
...                 ...           ...           ...           ...
777        ([157], [6])   ([36], [2])  ([145], [3])  ([157], [6])
875         ([82], [5])   ([82], [6])  ([157], [4])  ([122], [6])
876         ([81], [2])    ([3], [1])    ([6], [1])   ([51], [1])
887        ([875], [2])   ([23], [1])    ([8], [1])   ([82], [1])
888        ([412], [1])   ([43], [1])  ([432], [1])   ([16], [1])

[159 rows x 4 columns]

In [55]:
kr_combined = pd.concat(kr_dfs.values(), axis=0)
kr_combined.head()

,Champion1,Mastery1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,157,109353,555,80202,122,53546,81,31706,517,28081
1,266,117626,54,77185,36,60833,53,39345,14,28882
2,58,250388,875,61353,141,53829,516,48399,234,34646
3,157,188270,777,65476,555,49046,517,41462,84,38462
4,122,38797,7,32084,238,25974,875,24392,777,21579

In [81]:
kr_combined[[f'Champion{i}' for i in range(1, 6)]] = kr_combined[[f'Champion{i}' for i in range(1, 6)]].replace(champion_ids_name)

In [82]:
euw_combined = pd.concat(euw_dfs.values(), axis=0)
euw_combined.head()

,Champion1,Mastery1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5
0,86,91814,75,89144,99,77068,32,56638,117,35227
1,157,137297,777,57998,62,27081,141,24226,266,22471
2,222,395187,518,213365,350,127739,498,113112,145,79875
3,98,153711,141,79765,5,75819,19,75211,11,73228
4,143,64077,59,53913,11,46980,412,41843,126,38971

In [83]:
euw_combined[[f'Champion{i}' for i in range(1, 6)]] = euw_combined[[f'Champion{i}' for i in range(1, 6)]].replace(champion_ids_name)

In [84]:
euw_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']] = euw_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']].div(euw_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']].sum(axis=1), axis=0)

In [85]:
kr_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']] = kr_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']].div(kr_combined[['Mastery2', 'Mastery3', 'Mastery4', 'Mastery5']].sum(axis=1), axis=0)

In [86]:
all_combined = pd.concat([na_combined, euw_combined, kr_combined], axis=0)
all_combined.head()

,Champion1,Champion2,Mastery2,Champion3,Mastery3,Champion4,Mastery4,Champion5,Mastery5,Mastery1
0,Swain,Fiora,0.315807,Ivern,0.270794,Amumu,0.217170,Yuumi,0.196229,NaN
1,MissFortune,Renekton,0.285521,Ryze,0.241858,Lucian,0.237341,Vayne,0.235280,NaN
2,Lux,Morgana,0.293407,Orianna,0.276986,Ahri,0.216683,Ziggs,0.212924,NaN
3,Renekton,Mordekaiser,0.266302,Galio,0.248730,Urgot,0.246121,Garen,0.238847,NaN
4,Akali,Kaisa,0.334869,Vayne,0.236290,Evelynn,0.224058,Zoe,0.204784,NaN

In [87]:
all_combined.shape

(31674, 10)

In [126]:
champ_value_counts = all_combined[all_combined['Champion1'] == 'Aatrox'][['Champion1', 'Champion2', 'Mastery2']][['Champion2']].value_counts().to_frame()
champ_value_counts.head()

              0
Champion2
Darius       13
Camille      12
Mordekaiser  12
Yasuo        10
Sylas         9

In [133]:
all_combined[all_combined['Champion1'] == 'Aatrox'][['Champion1', 'Champion2', 'Mastery2']].groupby('Champion2')[['Champion2', 'Mastery2']].mean().reset_index()

   Champion2  Mastery2
0      Akali  0.326925
1      Amumu  0.400151
2      Brand  0.362340
3    Camille  0.400544
4    Chogath  0.308308
..       ...       ...
80    Yorick  0.441589
81       Zac  0.401014
82       Zed  0.337586
83    Zilean  0.297490
84       Zoe  0.348424

[85 rows x 2 columns]

In [136]:
testing_df = all_combined[all_combined['Champion1'] == 'Aatrox'][['Champion1', 'Champion2', 'Mastery2']].groupby('Champion2')[['Champion2', 'Mastery2']].mean().reset_index().merge(champ_value_counts, on='Champion2')
testing_df.head()

  Champion2  Mastery2   0
0     Akali  0.326925   3
1     Amumu  0.400151   2
2     Brand  0.362340   1
3   Camille  0.400544  12
4   Chogath  0.308308   1

In [138]:
(testing_df['Mastery2'] * testing_df[0]).sum()

81.85010772614656

In [142]:
testing_df.loc[5]

Champion2      Darius
Mastery2     0.386705
0                  13
Name: 5, dtype: object

In [141]:
((testing_df['Mastery2'] * testing_df[0]) / (testing_df['Mastery2'] * testing_df[0]).sum()).sort_values(ascending=False)

5     0.061419
40    0.060074
3     0.058724
78    0.041676
60    0.036711
        ...
16    0.003486
61    0.003460
42    0.003449
74    0.003226
20    0.003215
Length: 85, dtype: float64

In [121]:
all_combined[all_combined['Champion1'] == 'Aatrox'][['Champion1', 'Champion2', 'Mastery2']]['Champion2'].value_counts()

Darius         13
Camille        12
Mordekaiser    12
Yasuo          10
Sylas           9
               ..
Illaoi          1
Zilean          1
Trundle         1
Shaco           1
Zac             1
Name: Champion2, Length: 85, dtype: int64

In [112]:
all_combined.groupby(['Champion1', 'Champion2'])[['Champion1', 'Champion2', 'Mastery2']].mean().loc['Aatrox']

           Mastery2
Champion2
Akali      0.326925
Amumu      0.400151
Brand      0.362340
Camille    0.400544
Chogath    0.308308
...             ...
Yorick     0.441589
Zac        0.401014
Zed        0.337586
Zilean     0.297490
Zoe        0.348424

[85 rows x 1 columns]

In [75]:
all_combined.groupby('Champion1')[[f'Champion{i}' for i in range(2, 6)]].agg(pd.Series.mode)['Champion5'].apply(lambda x: isinstance(x, np.ndarray)).sum()

48

In [29]:
pd.value_counts(all_combined[all_combined.isin([1]).any(axis=1)].values.flatten()).index[1:4]

Int64Index([99, 157, 45], dtype='int64')

In [35]:
def top3_by_id(id):
    return np.array(pd.value_counts(all_combined[all_combined.isin([id]).any(axis=1)].values.flatten()).index[1:4], dtype=np.int16)

In [37]:
import json

In [38]:
raw_champions = None
with open('data/champions.json') as f:
    raw_champions = json.load(f)

In [43]:
int(raw_champions['data']['Aatrox']['key'])

'266'

In [45]:
champion_ids = []
for champ in raw_champions['data'].keys():
    champion_ids.append(int(raw_champions['data'][champ]['key']))
champion_ids = np.array(champion_ids, dtype=np.int16)

In [48]:
champion_ids

array([266, 103,  84, 166,  12,  32,  34,   1, 523,  22, 136, 268, 432,
        53,  63, 201,  51, 164,  69,  31,  42, 122, 131, 119,  36, 245,
        60,  28,  81,   9, 114, 105,   3,  41,  86, 150,  79, 104, 887,
       120,  74, 420,  39, 427,  40,  59,  24, 126, 202, 222, 145, 429,
        43,  30,  38,  55,  10, 141,  85, 121, 203, 240,  96,   7,  64,
        89, 876, 127, 236, 117,  99,  54,  90,  57,  11,  21,  62,  82,
        25, 267,  75, 111, 518,  76,  56,  20,   2,  61, 516,  80,  78,
       555, 246, 133, 497,  33, 421, 526, 888,  58, 107,  92,  68,  13,
       360, 113, 235, 147, 875,  35,  98, 102,  27,  14,  15,  72,  37,
        16,  50, 517, 134, 223, 163,  91,  44,  17, 412,  18,  48,  23,
         4,  29,  77,   6, 110,  67,  45, 161, 711, 254, 234, 112,   8,
       106,  19, 498, 101,   5, 157, 777,  83, 350, 154, 238, 221, 115,
        26, 142, 143], dtype=int16)

In [36]:
top3_by_id(2)

array([ 64, 104, 141], dtype=int16)

In [51]:
champion_ids = sorted(champion_ids)

In [52]:
connections = []
for id in champion_ids:
    connections.append(top3_by_id(id))

In [54]:
connections_df = pd.DataFrame(connections, index=champion_ids, columns=['Common1', 'Common2', 'Common3'])
connections_df.head()

   Common1  Common2  Common3
1       99      157       45
2       64      104      141
3      517       99      157
4       81       64      157
5       64       11      141

In [56]:
connections_df.shape

(159, 3)

In [58]:
connections_df.to_csv('out_data/champion_connections.csv')